Autodesk.Revit.DB.Architecture.BreakPatternCondition
Condition on which patterns distribution will be broken.
Since:
2019

Autodesk.Revit.DB.Architecture.BreakPatternCondition.Never
Patterns are distributed along whole path of a railing.

Autodesk.Revit.DB.Architecture.BreakPatternCondition.AnglesGreaterThan
Patterns distribution is broken if the angle between neighboring path segments is greater than the defined.

Autodesk.Revit.DB.Architecture.BreakPatternCondition.EachSegmentEnd
Patterns distribution is broken at each segment end.